--------------------------------
指数基金
--------------------------------
	# 指数基金（也叫被动型基金）
		* 基金经理不主动寻求市场的表现，一般选取特定的股票作为投资对象，视图复制整个市场的平均收益。
		* 和主动型基金不同，它的风险收益不依赖基金经理，而是整个市场
		* 长期来看，相对主动型基金，被动型基金的收益更高更稳定
	
	# “指数” 和 “成分股”
		* “指数”就是一个选股规则，它按照某个规则挑选出一篮子股票
		* 由专业机构通过复杂的计算，得出一个代表这篮子股票的“平均价格”
		* 然后用这个价格来反映市场上，这一类股票的价格水平
	
		* 这个“平均价格”称为“指数点位”，篮子中的这些股票称之为这只指数的成分股

		* 指数的成分股是可以变化的，一旦某只股票不能满足原先的规则，就会被替换掉
	
	# 指数基金的特点
		* 灭绝人性(不需要经理“人”的决策，避免老鼠仓这种问题)
		* 永垂不朽(不害怕“指数”中的一些公司倒闭，因为会有新的公司补充进来，铁打的指数流水的公司)
		* 笑到最后(通过投资指数成分股获取市场持平的收益，只要经济是持续向好的，指数基金就有投资的价值)
	
	# 指数基金的风险
		* 本质还是股票型基金，异常存在风险
		* 指数基金是复制和跟踪指数，来调整篮子里面的股票组合，如果基金经理复制有偏差或者没有及时跟着调整指数，也可能带来收益方面的误差风险。
		* 指数基金的规模小或者历史不长的话，也会有风险

--------------------------------
指数基金分类
--------------------------------
	# 按照行业分类
		* 不限制行业的指数基金，宽指数基金
			* 上证50指数，沪深300指数 等就是宽指数
			* 最大的优势就是覆盖行业广，分配均匀，盈利更加稳健

		* 只投资某个行业的指数基金，行业指数基金
			* 上证消费80(消费行业)，中证医疗指数(医疗行业)，中证白酒指数(白酒行业) 等就是行业指数
			* 需要考虑整个行业的发展特点与阶段，受行业影响到，风险会比较高一点
	
	# 按复制方式分类(跟主动基金和被动基金的概念一样)
		* 完全复制型指数基金
			* 完全复制指数所包含的所有成分股
			* 照葫芦画瓢，追求的是，获得和跟踪指数持平的收益

		* 增强型指数基金
			* 除了复制目标指数外，基金经理还会加入自己的一些主观投资
			* 追求超过跟踪指数的收益

--------------------------------
各种指数
--------------------------------
	# A 股(简单理解为中国大陆的股票市场)市场主要的指数
		* 上证50指数
			* 上海证券市场最大，流动性最好的50只股票组成
			* 反应了沪市最具市场影响力的龙头企业的整天状况

		* 沪深300指数
			* 沪市和深市，市值排名前300的上市公司组成
			* 是国内影响力最大，最重要的指数

		* 中证500指数
			* 沪市和深市，市值排名前800的上市公司中，前300家入围了沪深300指数
			* 而剩下的500家，则组成了中证500指数，代表了中国股市中小型上市公司的平均水平
		
		* 创业板指数
			* 专门选择100家小型企业，也就是在创业板上市的公司
			* 这些公司，规模不大，盈利不够多，被主板上市的门槛挡在门外，于是退而求其次，选择在创业板上市。

		* 红利指数
			* 挑选在上证交易所上市的，现金股息率高，分红比较稳定，具有一定规模以及流动性的50只股票
			* 是A股市场真正核心优质资产

	# 港股
		* 恒生指数
			* 1964年诞生，从港股公司中选择50家具有代表性的公司股票组成的指数
			* 是香港股市价格非常重要的指标

		* H股指数
			* 被称为“恒生中国企业指数”，或“国企指数”
			* 它挑选了在香港上市的，规模最大的33家大陆企业
	
	# 美股
		* 标普500指数
			* 由美国标准普尔公司选定，代表美国股票市场的500家上市公司的指数

		* 纳斯达克指数
			* 涵盖了纳斯达克市场上所有的美国和外国公司
			* 是证券市场上非常有影响力的一只指数

	
--------------------------------
指数基金的筛选
--------------------------------
	# 确定想要投资的指数
		* 选择指数基金的本质就是选择指数
		* 指数本身没有好坏，只有适合与否
		* 一般选择一个代表性强，主流的指数即可，只要是指数长期向上，就可以纳入投资范围
		* 想获得市场平均收益，可以选择代表A股的沪深300指数

	# 精选靠谱的基金公司
		* 基金公司的实力对指数基金的表现有至关重要的作用
		* top10的基金公司，实力和经验都比小公司好
		* 大基金公司长期运营的指数基金更是首选

		* 有实力的基金公司，资金规模一般都超过1000亿，低于1000亿，就不用考虑

	# 锁定指数基金
		1) 跟踪率误差
			* 要低于同行水平，越低越好，越低说明基金运作水平高，误差风险小
			* 跟踪误差率是判断一个指数基金好坏的关键

		2) 基金规模
			* 不能过小，规模小说明买的人少，流动性差，流动性一查，买的人更少了，清盘的概率比较大
			* 一般规模不要小于2亿

		3) 成立年限
			* 小于1年的不要考虑，最好选择超过3年的
			* 如果基金连续3年都保持优异的成绩，说明这个基金受得住考验

		4) 费用成本
			* 基金的费用：管理费，托管费，申购费，赎回费
			* 挑选的时候，费用越低越好
			* 场内基金无关是管理费还是交易费，都远低于场外基金

--------------------------------
指数基金的估值
--------------------------------
	# 估值指标: 温度
		* 温度越高，说明股市越火爆，风险越大，上涨空间越小
		* 温度越低，说明股市越冷清，风险越小，上涨空间更大

		* 温度计算公式：温度 = (PE温度 + PB温度) / 2

	# 温度在线计算
		* 找一些在线软件
	

--------------------------------
指数基金投资方式
--------------------------------
	# 一次性投资
		* 简单省事儿，无脑买入
		* 不建议

	# 不定期投资
		* 择时投资，找到合适的时机才下手买
		* 绝大部分人都没这种能力，巴菲特都做不到

	# 定期金额
		* 固定每个月得某一天，用固定金额投资某个基金

	# 定期不定额(推荐)
		* 固定每个月得某一天，用不同的金额投资某个基金
		* 便宜，多买。贵，少买。
	
	
	# 定投的最佳实践
		* 设置定投日提醒
		* 不要在定投过程中加入自己的主观判断, 克服人性中贪婪和恐惧的弱点
		* 投资收益投入再利用, 把赚到的钱作为投资本金, 继续投资

	# 投资步骤
		* 确定每个月的投资金额
			1) 有投资目标，每个月投资金额的计算
				.... 找软件计算吧

			2) 没有投资目标，每个月投资金额的计算
				总存量资金  = 存款 - 3到6个月基本日常支出 
				每个月存量资金 = 总存量资金 / 20个月
		
	
			


