---------------------------
投资的原则
---------------------------
	# 闲钱 + 长期定投

----------------------
基金分类
----------------------
	# 投资品种分类
		* 货币基金
			- 企业债
			- 银行定期存款
			- 地方政府债
			- 国债
			
			* 投资债券占比没有要求，一般都是投资短期债券，1年以内的
			* 特点：流动性高，收益稳定
			* 余额宝，就这玩意儿

		* 债券基金
			- 企业债
			- 股票
			- 地方政府债
			- 国债

			* 投资债券的占比，必须在80%以上，而且投资基本都是1年以上的债券
			* 特点：流动性低，风险略高了一点(投资了股票)，收益稳定
			* 适合投资半年，一年以内用不到的钱

		* 股票基金，股票为主，风险高收益大
			* 股票投资的占比必须在80%以上

		* 混合基金
			* 可以同时投资债券，货币 ，股票的基金，配置比例很灵活，以适应市场。从而获取最高的利益。
		
		* QDII基金
			* 主要投资于海外市场（包括港股、美股等）的基金
			* 全球配置规避风险，全球投资，降低了因国内或国外单一市场带来的系统风险
			* 风险级别类似股票型基金，该类型基金的风险主要有汇率风险(基金以人民币计价，但以美元等外币进行投资)，海外当地经济形式和政策等因素影响
		
		* 组合基金
			* 你妈基金中的基金...
			* 就是将几只基金组合在一起出售, 事实上这也是一种带有FOF概念的产品


	# 交易渠道分类(场内外，就是证券交易市场)
		* 场内基金
			* 直接和买家/卖家交易，需要开通专门的账户
			* 场内基金价格实时变动

		* 场外基金
			* 交易的对象是基金公司，支付宝就是场外基金
			* 场外基金根据供求关系而变化

	# 运作方式分类
		1)开放式基金，基金分额不确定，总资金量大小不固定，投资者可以自由的买入买出
			* 开放式基金，不在交易所交易，一般由营业银行，证券营业部等第三方机构代销

		2)封闭式基金，发行前分额确定，发行结束后封闭
			* 在基金的封闭期间，不能赎回，投资者只能和其他基金持有者通过二级市场（证券交易所）进行买卖

		3)ETF基金
			* 交易型开放式指数基金，集上面两家之长合一体，可以向基金公司申购或者赎回基金份额，也可以在二级市场上交易基金份额
			* 采用指数化投资策略，特点是：实物申购，赎回机制，投资者只能通过自己手上的股票来买卖ETF份额
			* 通过银行，券商，基金等金融机构申购ETF基金，门槛很高，需要50W，100W的资金起步。大都是专业投资者的申购方式
			* 一般人玩儿不起

		4)ETF连接基金
			* 简单的说就是：投资目标为“ETF基金”的基金，只能在一级市场申购赎回
			* 它能复制90%以上的ETF基金走势
			* 让一般人也能玩儿得起 ETF 基金
			

	# 投资方式分类
		* 主动形基金
			* 基金经理代替投资者进行投资，投资的股票，债券都是基金经理说了算
			* 主动出击，寻求超越平均水准的超值回报

			* 非常依赖基金经理的能力，能力的好坏直接决定了基金业绩，这是主动型基金的致命缺点

		* 被动型基金（也叫指数基金）
			* 基金经理不主动寻求市场的表现，一般选取特定的股票作为投资对象，视图复制整个市场的平均收益。
			* 和主动型基金不同，它的风险收益不依赖基金经理，而是整个市场
			* 长期来看，相对主动型基金，被动型基金的收益更高更稳定

	# 一些基金
		* 支付宝： 货币基金/场外基金/开放式基金
	
	# 场内外的意思
		* 场内，必须是在证券公司股票交易系统中进行卖买
		* 证券公司也就是俗称的券商

		* 场外，则是通过银行网银基金公司网站进行交易
		* 支付宝就是一个场外平台

----------------------
看懂基金招募说明书
----------------------
	# 这玩儿没法直接看完，太长了好几百页
	# 在基金公司官网下载《基金招募说明书》
		* 推荐在巨潮网下载
		* 在搜索框中输入： <基金代码> 招募说明书
	

	# 查看基金类型
		* 可以判断出风险程度
	
	# 基金管理人概况
		* 查看“基金管理人”和“基金托管人”，是否有啥旧的丑闻，违规违纪等等信息
		* 查看“基金经理”，考察从业时间（一般3年以上的比较靠谱）和业绩水平
	
	# 投资范围和投资策略
		* 投资的产品，以及投资的比例。
		* 基金保留的现金以及购买债券的比例（开放式基金的自由买入买出，可以依赖这笔钱）



---------------------------
问题
---------------------------
	# “指数分级基金”和其他指数基金的区别
	# 一级市场，就是“发行方，基金公司”吗？
	# 二级市场，就是“交易所”吗？
