----------------------
货币基金筛选4大指标
----------------------
	# 收益率
		* 查看2个指标：“每万份收益”和“7日年化收益”
		* 万分收益：按照上一个交易日的收益率，1万块钱，能赚多少钱
		* 7日年化收益：根据过去7天的收益总和，计算出的一年收益

		* 一般来说货币基金的万份收益在1%左右，7日年化在3%左右

	# 流动性
		* 流动性指的是，基金卖出后，资金可以多久到自己账户
		* 一般来说，有T+0(及时清算交割)，和T+1(隔日交割)两种交割方式

	# 成立时间
		* 货币基金的成立时间在3-5年以上比较好
		* 如果基金太年轻，就没有足够的历史收益数据作为参考，从而做出合理的评估
		* 相对老年基金，年轻基金缺乏市场的磨练，可能隐藏很高的风险

	# 基金规模
		* 适中即可，一般：20亿 - 2000亿，规模越大意味着基金中的钱越多
		* 规模越大的货币基金，有更充足的资金对应赎回，也能留有更多的资金用来投资
		* 规模越大，因为资金问题而无法正常运转而被清盘的风险也会比较低
		* 规模不太大，可选择的投资品会受限，收益反而会下滑

-----------------------------
债券基金的筛选跟货币基金一样
-----------------------------
	# 成立时间
		* 3 - 5 年以上

	# 收益率
		* 看累计3年以上的收益率，有限选择收益率更高的
	
	# 规模
		*  适用。5亿-100亿

	# 费率
		* 越低越好

	# 基金经理的更换频率
		* 频繁更换，就不好，主帅经常换，没法估算下一场的业绩。
		* 更换频率不能低于半年
	

-----------------------------
混合基金筛选7大指标
-----------------------------
	# 收益率
		* 看累计3年以上的收益率，有限选择收益率更高的
	# 成立时间
		* 成立时间在3年以上的，更稳健

	# 基金规模
		* 不能太小，也不能太大，适中即可
		* 太小，资源少风险大。太大，过于保守收益可能不高
		* 2亿 - 100亿 建议

	# 手续费
		* 越低越好

	# 基金经理的更换频率
		* 越低越好

	# 基金公司的盈利能力
		* 查看这个公司在同类公司中的排名，如果排在后面，基本就可以放弃了
		* 选择排名靠前的公司

		* 看他的盈利是否跑赢了沪深300指数，沪深300可以大致代表大盘的走势

	# 基金经理的选股择时能力
		* 从四个指标来分析：
			1)从业情况
				* 一般也要大于3年才行
			2)评分
				* 越高越好，评分高于50分的比较有保障
			3)星级
				* 越高越好，3星以下可以排除
			4)管理的基金收益排名
				* 收益排名没有跑赢同类平均水平的可以排除
		


------------------------------------------
股票基金筛选跟混合基金的筛选差不都多一样
------------------------------------------
	# 基金业绩
	# 基金规模
	# 成立时间
	# 费率
	# 基金经理的选股能力
	# 基金经理的更换频率
	# 基金公司的盈利能力


----------------------
箴言
----------------------
	# 股票基金和混合基金
		* 在熊市表现很烂，在牛市表现要强于大盘的基金要慎重
	
