----------------------------
设计模式					|
----------------------------
	# 是面向对象语言中一个比较重要的知识点
	# 编程语言只是工具,编程思想才是最有价值的东西
	# 设计模式(GOF23)Group Of Four 23
		* 国外的四个大牛,总结的一些写代码的套路
	
	
	# 设计原则
		* 把程序中变动于固定的方面分离
		* 针对接口编程，不针对实现
		* 多用组合，少用继承

----------------------------
设计模式					|
----------------------------
	# 创建型模式
		单例模式
		工厂模式
		抽象工厂模式
		建造者模式
		原型模式

	# 结构型模式
		适配器模式
		桥接模式
		装饰模式
		组合模式
		外观模式
		享元模式
		代理模式
	
	# 行为模式
		模版方法模式
		命令模式
		迭代器模式
		观察者模式
		中介者模式
		备忘录模式
		解释器模式
		状态模式
		策略模式
		职责链模式
		访问者模式

