------------------------
decimal					|
------------------------
	* 精准数值表达式,跟JAVA的 BigDeciaml 和 BigInteger 一样
	* Demo
		a = decimal.Decimal("1.2596596262")
		b = decimal.Decimal("9.66961515225")
		c = a + b
		print(c)
	
	* 它只能与 decimal 或者 int 进行计算,不能直接与 float 进行计算
		

------------------------
decimal-方法			|
------------------------
	Decimal(num)
		* 参数可以是整数/浮点数,以及对应的字符串
		* '如果参数是浮点数的字符串,可能会带来计算精度丢失的问题'
			a = decimal.Decimal(9.669)
			b = decimal.Decimal('9.669')
			print(a)			//9.669000000000000483169060316868126392364501953125
			print(b)			//9.669
	


------------------------
decimal-函数			|
------------------------
