--------------------------------
请求参数						|
--------------------------------
	* 标准的form表单参数体
		request.POST
		* 该值属性为 dict 子类 QueryDict,可以直接使用 dict 的api进行取值操作
	
	* 多value请求体
		request.GET.getlist('name')
		request.POST.getlist('name')
		* 使用 getlist() api来获取值的集合[]

	
	* 标准的JSON请求体
		request.body
		* 该值属性为二进制 bytes
		* 可以直接使用json,序列为JSON对象,json.loads(request.body)

--------------------------------
请求地址						|
--------------------------------
	* 简单不多说,该属性值是一个str
		request.path

--------------------------------
请求头							|
--------------------------------

--------------------------------
Cookie							|
--------------------------------
	* 简单不多说,该属性值是一个 dict
		request.COOKIES

--------------------------------
文件上传						|
--------------------------------
	* 单个文件上传

	* 多个文件上传
	