
----------------------------
网络编程					|
----------------------------
	#  学习地址
		http://www.52im.net/forum.php?mod=collection&op=all
		http://www.52im.net/topic-tcpipvol1.html

	#  socket
		RFC 797(IP地址和端口的结合协议)

----------------------------
osc							|
----------------------------
	# 七层
		Application
			* 应用层		FTP HTTP
		Presentation
			* 表现层
		Session
			* 会话层
		Transport
			* 传输层		TCP UDP
		Network
			* 网络层		IP[IGMP ICMP ARP]
		Data Link
			* 数据链路层
		Physical
			* 物理层
	
	# 五层

----------------------------
报文段						|
----------------------------
	# 报文在传输过程中,会不断的封装为组,包,帧来传输
	# 封装的方式就是添加一些控制信息组成的首部,就是报文头

----------------------------
ip地址						|
----------------------------
	# 五大类: A B C D E
	# E 类属于特殊保留地址
	
	1.1.1.1
		* 直接广播地址
		* 理论上来说,会往所有的互联网地址都广播数据包(但是会被防火墙拦截)
	
	255.255.255.255
		* 受限广播地址,会往局域网广播数据包
	
	# ipv4 可以转换为 ipv6,反之肯定不行
	


----------------------------
tcp/udp						|
----------------------------
	TCP
		* 面向连接
		* 通过三次握手建立连接,通信完成要断开连接
		* 端到端的通信

	UDP
		* 面向无连接
		* UDP数据中包含了目的地端口号,和自己端口号
		* 可以广播

----------------------------
网络编程问题				|
----------------------------
	数据完整性
		粘包 拆包 半包
	长连接 
		心跳
		断线重连
	文件分段传输
		