------------------------
pickle					|
------------------------
	* 有点像是Java中的:java.io.Serializable
	* 用于对Python数据进行序列化和反序列化的二进制协议
	* 仅仅只能在Python中序列,反序列的API,就算是不同的版本也会有差异

------------------------
pickle-模块属性			|
------------------------

------------------------
pickle-模块函数			|
------------------------
	bytes dumps(obj)
		* 把数据,序列化为二进制数据
	
	None dump(obj,file)
		* 把一个数据,序列化为二进制数据,并且保存到指定的文件(open('xx','wb'))
	
	obj loads(bytes)
		* 从二进制数据中,反序列化Python数据

	obj load(file)
		* 从指定的二进制文件,反序列化Python数据(open('xx','rb'))
