------------------------
基本运算				|
------------------------
	+
	-
	*
	/

	# 两数相除的问题
		* 两数相除,想要得到小数部分,分子分母必须有一个是小数,否则结果只会取整
			printf("%f", (double)(5 / 2));		//2.000000
			printf("%f", (double)(5.0 / 2));	//2.500000
		
	# 整数与小数相乘/除结果为小数
		
		

------------------------
循环					|
------------------------
	do{}while();
	while(){}
	for(;;){}

------------------------
判断					|
------------------------
	&&
	||
	！

	* 带短路

------------------------
支持三元运算			|
------------------------
	int x = (5 > 4) ? 5 : 2;

------------------------
switch					|
------------------------
	int num = 4;
	switch(num){
		case 4:{
			printf("4");
			break;
		}
		case 5:{
			printf("5");
			break;
		}
		default:{
			printf("没");
			break;
		}
	}

	# 数据类型只能是整形和字符型变量

------------------------
goto 					|
------------------------
	# 没卵用
		-----------
		loop:for(;;){
			goto loop;
		}
	
		-----------
		goto GO_TO;
		
		printf("执行了1\n");
		printf("执行了2\n");

		GO_TO:{
			printf("执行了GOTO");	//上面两句打印会被跳过,不会执行
		}

------------------------
其他 					|
------------------------
	&	
		- 返回变量的地址
		- &a, 将给出变量的实际地址
	*	
		- 指向一个变量
		- *a; 将指向一个变量