---------------------------
Seo
---------------------------
	# 标题
		* 最多26个字符数
		* 建议
			- 核心词 品牌词
			- 核心词 需求词 品牌词、

	# 描述
		* 60 - 78个字符
		* 尽量要包含标题中的词

	# 关键字
		* 3 - 5 个关键词，使用英文逗号分隔
		* 尽量跟标题相关
		* 不要堆积词
	
---------------------------
Seo - 内部优化
---------------------------
	# 以搜索量多的关键词作为选题
		* 要思考目标用户可能会检索的关键词，再进行有针对性的创作。简单来说，关键词就是目标用户可能会在搜索引擎中检索的问题。
		* 还要知道哪个关键词的搜索量最高。当一个关键词的搜索量越高，说明可以越多的目标用户。
		* 当依据关键词来确定选题的时候，有两个需要确定的因素：
			1. 关键词是什么
				* 直接收集的方式，是指直接向目标用户了解他们想要解决的相关问题，比如在发布表单来收集用户的信息时，都有一个询问用户兴趣的问题，来了解我们的用户会对什么样的内容感兴趣。
				* 间接收集的方式，通过搜索引擎本身，或者5118的关键词挖掘，百度搜索指数的用户图谱，来收集关键词
				* 还可以通过关键词规划工具来收集更多的关键词

			2. 关键词的搜索流量有多少
				* 百度关键词规划师
				* 长期监测关键词流量的变动，关键词的搜索指数并不是长期不变的，所以要做好定期的关键词监测，及时了解关键词的变化，从而调整文章的选题
		
			* 5188 https://www.5118.com/
			* 百度指数	
			* 百度关键词规划师 http://index.baidu.com/
		
	# 永远关注文章本身质量，文章质量 > 文章数量
		1. 文章字数
			* 文章质量的评估包含了“文章是否兼具深度和广度”
			* 一篇文章少于 1000 字，那么是绝对不可能兼具深度和广度的
			* 字数在 2000--3000 字数的文章就更容易被判断为是一篇具有深度和广度的优质文章，从而被搜索引擎推荐。
		
		2. 原创性
			* 为了尊重原创，搜索引擎可以通过大量的数据检索你的文章与其他文章的重复性，如果文章内容有大段的重复，那么也不会得到搜索引擎的推荐
			* 飓风算法会打击这类采集的文章
		
		3. 易读性
			* 要考虑移动端的易读性，排版和创作上是对用户友好的，从而用户会更愿意阅读你的文章
		
		4. 丰富性
			* 善用多媒体工具创作文章内容,一篇既有图片又有视频的文章，很有可能会被搜索引擎判为一篇优质的文章。
			


	# 提升文章与关键词的匹配度
		* 只有先被搜索引擎所看见，才能继而被我们的目标用户所看见。
		* 放置关键词的位置
			1. 文章标题
				* 最好是把目标关键词放在文章标题的前半部分，这样的做法会让搜索引擎认为你注重标题开头的文字，搜索引擎会知道你的文章和你想要关联的目标关键词强相关。
			
			2. 文章前100字
				* 在文章的前100个字只谈论与关键词相关的内容，这样会让搜索引擎认为你的文章和关键词的相关度很高。
			
			3. 文章小标题
				* 在写文章的时候，不会把2000字的内容从头写到尾，会添加一些小标题使得我们的文章有清晰的逻辑结构
				* 那么在设置小标题内容的时候，也不要放过抓住关键词的好机会，同样，把关键词尽可能地放置在小标题的前半段，来吸引搜索引擎。
			
			4. 图片或视频的文字描述
				* 在一些自媒体的内容创作平台中，比如简书、百家号等，当插入图片的时候，在图片下方可以对关键词进行描述，在文字描述中你就需要尽可能地添加目标关键词及相关关键词。
			
			5. 文章标签
				* 在一些内容管理平台中，此标签默认地展示了页面的标题。
			
			6. URL：
				* 一个由乱码组成的网址容易被搜索引擎判定为是一组不稳定的、随时会被更改的URL，所以当用户用关键词搜索的时候，很难通过搜索引擎搜索到网站。
				* 做文章的SEO优化，在URL上也要添加上关键字，使得搜索引擎更容易检索到你的文章。
				* 但是这一个方法对于很多内容管理平台是十分有限的，比如在百家号上发布的文章是不可以随意设置URL的，通常只有在自己的网站内才可以对URL进行修改。
			
			* 关键词不是只可以有目标关键词1个，可以把之前在选题步骤中所收集的关键词词库都充分地利用起来
		
	
	# 决定选题、创作文章内容、布局关键词的每一个环节中都记得讨好搜索引擎，那么搜索引擎也会很快地找到我们，并推荐给我们想要找到的目标用户。


	
---------------------------
Seo - 外部优化
---------------------------
	# 外部SEO优化的逻辑，就是要尽可能地让自己的文章被别人引用，从而告诉搜索引擎这篇文章的价值
		* 外部SEO有其固定的游戏规则，只要遵守游戏规则，就可以不被搜索引擎惩罚，甚至还获得搜索引擎推荐的福利。

	# 选择权威的外部链接
		* 链接所在网站的权重
			* 网站权重是搜索引擎对网站权威性的评价。网站的权重高，就说明其网站的信任度越高，搜索引擎更愿意推荐这些网站上的文章

		* 链接所在页面中的位置
			* 外部链接处在页面上方的位置，比处在页面下方的位置，有更高的权重。

		* 链接呈现的方式
			* 文字链接的权重远大于图片链接的权重。

		* 链接存在的历史时间
			* 搜索引擎时时会更新，会导致发现自己的外链丢失，如果不定期做好外链的监测，及时地了解外链丢失的情况，那么尽管在一开始获得了一个高质量的外链，那么也对SEO无益
		
		1. 充分利用SEO的相关工具
		2. 利用搜索引擎寻找权威站点
			* 拓展与自己行业相关的行业，在这些行业的关键词下面，寻找在搜索引擎中排名比较靠前的站点，做外链的交换
		3. 模仿同行做得好的外链建设
			* 在自己要做的关键词下，找到排行前5的同行，了解他们一般会在哪里放置外链后，模仿着去建设自己的外链就可以了


	# 选择相关性高的外部链接	
		* 页面内容的相关性，外链所在的页面，要和自己网站内容是直接相关的。
		* 站点垂直度相关性
		* 一个优质的外部链接，最好还要放置在页面中上下文相关联的位置处
		* 参考同行的外链，寻找相关性高的外部链接

	# 利用社交媒体做免费外链
		* 通过在社交媒体上建立起品牌的权威性和可信赖性，从而间接地有利于在搜索引擎中的排名。

		
		* 微博：在微博上发表自己的文章短链接
		* 知乎：知乎的权威性和可信赖性是很高的
		* 豆瓣：主要来负责做长尾关键词
		* 简书：在百度上的权重越来越高了

	
	# 总地来说，外部SEO，就是在保证文章质量这一大前提下的技术活。
	# 所以，最最最最重要的是，我们要不断地注重提升自己的文章质量，写出用户喜欢并欣赏的内容。只有把内容先做好了，才有足够的自信去做SEO优化。

	
		