----------------
投资
----------------
	# 资产与负债
		* 能把钱放入自己口袋的叫资产
		* 把自己口袋的钱拿出去的叫负债

		
	# 财商的组成
		1. 财务知识，也就是阅读数字的能力。
		2. 投资策略，即以钱生钱的科学。
		3. 市场，供给与需求，在市场上，总是有买方就会有卖方。
		4. 法律规则，必须按照规则来进行游戏。
	

	# 投资者分为2类人
		1. 最普遍的一类人，即进行一揽子投资的人
		2. 自己创造投资机会的人，必须要具备3种技能
			1. 如何寻找其他人都忽视的机会
			2. 如何增加资金
			3. 怎样把精明的人组织起来
		

	# 拥有财务知识后，还需要克服的困难 - 开端
		1. 恐惧心理
		2. 愤世嫉俗
		3. 懒惰
		4. 不良习惯
		5. 字符
	
	# 10个步骤来开发上帝赐予你的才能，这种才能只有你才可以控制 - 开始行动
		 1. 我需要一个超现实的理由 - 精神的力量
		 2. 每天做出自己的选择 - 选择的力量
		 3. 慎重的选择朋友 - 关系的力量
		 4. 掌握一张模式，然后再学习一种新的模式 - 快速学习的力量
		 5. 首先支付自己 - 自律的力量，如果你控制不了自己，那么就别想着致富
		 6. 给你的经纪人以优厚的报酬 - 好建议的力量
		 7. 做一个“印第安给予者” - 无私的力量
		 8. 用资产来购买奢侈品 - 专注的力量
		 9. 对英雄的崇拜 - 神话的力量
		10. 先予后取 - 给予的力量

	# 开创事业必备的最重要的3种管理技能
		1. 现金管理
		2. 人事管理
		3. 个人时间管理
	

