-------------------------
利润表
-------------------------
	# 利润表是表示一个时段的概念，表示某个时间段的利润结构
	
	# 资产负债表的“未分配利润”，就是和利润表有直接的联系

	# 一些计算公式
		毛利 = 收入 - 成本
		利润总额 = 营业收入 + 营业外收入 + 补贴收入(如果有) + 汇兑损益(如果有)
		净利润 = 利润总额 - 所得税


	# “应税所得” 和 “利润总额”
		* 纳税金额要按照一个“数据”来进行计算
			
		* 应税所得
			* 以税法为基础计算
		
		* 利润总额
			* 以会计准则计算
		
		* 案例解析:
			* 税法规定：公司广告支出超过了营业收入的一定比例之后，超过的部分，不能在税前列支
			* 假设这个比例是：2%

			* 公司有1个亿的收入，广告投放花费2千万。

			* 按照会计准则，2千万全部记在了“营业费用”中。
				1亿 - 2千万 = 8千万
				8千万 * 税率 = 应交税额

			* 按照税法，只能记200W在“营业费用”中。因为广告支出不能超过 2%
			* 此时“应税总额”会比“利润总额”多出1800W(9千8百万 - 8千万)，这笔钱同样要按照 25%的所得税去缴纳
				1亿 - 200百万 = 9千8百万
				千8百万 * 税率 = 应交费额
	
	# 一些概念
		收入 != 收到现金
		费用 != 付出现金
		利润 != 现金流

	# 项目
		* 营业收入
		* 营业成本
		* 营业税金及附加
			- 营业税
			- 营业税的附加税费
			- 增值税的附加税费

		* 营业费用
			- 广告费, 仓储费, 运费等等
			- 销售人员工资开支, 销售办公室大楼的折旧

		* 管理费用
			- 管理部门人员工资, 行政开支, 行政大楼的折旧

		* 财务费用
			- 银行存款的利息
		
		* 投资收益
		
		* 资产减值的损失
			- 根据历史成本计费的资产收益(非金融，投资性房产)

		* 公允价值变动收益
			- 金融资产和投资性房产的收益
	
		* 营业外的收入(跟经营活动没有关系)
			- 存货盘盈(清点仓库，发现存货比账上的要多)
			- 出售固定资产，得到的收益
		
		* 营业外支出
			- 存货盘亏(清点仓库，发现存货比账上的要少)
			- 天灾人祸啥的导致的损失
			
		* 补贴收入
			- 政府给的财政补贴
	
		*  汇兑损益
			- 国际贸易，因为费率变化导致的收益
		
		* 净利润


		--- ?
		* 生产成本
			- 工人工资, 原材料, 生产车间的折旧
		

	
	# 税务的概念
		* 流转税(不管赚到钱没赚到钱都要缴的税)
			- 营业税(价内税)
				* 这个税金，是记在商品的价格之内的，本质上是经营者承担的

			- 增值税(价外税)
				* 这个税金，是记在商品的价格之外的，本质上是由消费者承担的
				* 对企业来说，这是一笔负债
		
		* 非流转税(只有赚到钱了才缴)
			- 所得税