------------------------------------
资产负债
------------------------------------
	# 会计恒等式
		资产 = 负债 + 股东权益

		* 所有的报表都必须要符合这个关系，不然就是报表做错了
	
	# 剩余求偿权
		股东权益 = 资产 - 负债

		* 股东是公司最终的风险和收益承担者，负债是固定的，不会因为企业的经营状况而改变
			* 赚钱多了，银行不会要你多还
			* 赚钱少了，银行不会要你少还

		* 公司经营的最终目标就是为股东赚钱
		* 这个公式反之，不能成立: 负债 = 资产 - 股东权益
	
	# 资产负债表带来的信息
		* 公司家底，公司财务状况

	# 资产负债表是一个“快照的概念”，表示的是此刻的资产与负债

------------------------------------
资产 - 钱用去做什么了，用到哪里去了
------------------------------------
	# 流动资产项(一般会按照“变成现金速度”来进行排列，越容易变现，写在最前面)
		* 可以快速的变成现金

		> 货币资金
		> 应收账款(卖出的东西, 还没入账的钱, 可能有风险收不回来，客户欠我的钱)
		> 其他应收(这笔钱，花出去了，也许能拿回来, 但是没有利润，跟销售产品没关系，类似于把钱借给了别人)
			- 员工出差，借备用金
			- 受意外损失而向有关保险公司收取的赔款

		> 预付账款(在供应商买东西，先付的定金，还没拿到货，供应商欠我的钱)
		> 存货(没卖出去的东西，在产品，原材料)
		> 待摊费用(提前买的东西，例如办公用品，它们会越用越少)
			- 最初是资产，随着时间流逝，变成了费用
			- 预付的房子租金，预付的广告费

	
	# 非流动资产项
		* 不能快速的变成现金

		> 长期投资
			- 参股别的公司，买国债（一般既有股权性质的投资，也有债券性质的投资）

		> 固定资产
			* 房子，地皮，汽车，设备。价值比较高。
			
			* 折旧，描述固定资产的损耗，例如设备损耗后，价值变低
			* 国外一般土地不会提折旧这个概念
		
		* 折旧的概念
		* 折旧是用来描述固定资产的损耗
		* 在折旧的过程中，不需要付给任何人现金，它只是在账上记录这种损耗
		* 折旧会导致，账表有费用，但是没有付出现金

		
	
	# 无形资产
		* 专利权，专有技术，版权，商标权，采矿权
		* 土地使用权(中国才有，其他国家是可以拥有所有权，也就是相当于固定资产)

		* 所有企业自创的无形资产，都不会在报表上提现，体现出来的，都是买的
		* 所以一些公司会把技术部分独立出来，成为一个子公司，母公司购买子公司的技术，就可以增加母公司的无形资产
			
	
	# 员工/人
		* 一般不会出现在资产报表中
		* 因为人权独立, 不属于任何公司(不是奴隶制了)

		* 也有例外，例如：棒球俱乐部，花重金挖了一个球星
		* 花一笔钱，带来一个可以赚钱的球星，他是一个资产，这笔钱纳入待摊费用
	
	# 生物资产
		* 农业，畜牧业的动物也是资产


	# 其他资产

	# 资产价值的计算
		* 购买时的价格，作为资产的价格（历史成本，只要不出售，就一直是购买时的价格，只会减，不会加）
		* 出于谨慎原则，如果资产贬值，那就使用贬值的金额作为资产的价格
		* 如果资产升值，还是以购买时的价格作为资产价格（升值了当没看见）

		* 有的公司，会把资产卖掉，再买回来，目的就是为了刷新“购买时价格”，增加资产价值

		* 金融资产，例外。它使用当前市场价格来进行计算。（公允价值）
		* 投资性房产，例外。它使用当前市场价格来进行计算。（公允价值）
			- 不是自己用，给别人用，准备随时卖掉，租出去。

		
------------------------------------
负债 - 钱是从哪儿来的
------------------------------------
	# 流动负债(短期内要求支付的负债)
		> 短期借款(跟银行等借的钱，一年内要偿还)
		> 应付账款(买了别人的东西，还没给钱，欠供应商的钱)
		> 其他应付款(类似于借了别人的钱，要还)
		> 预收账款(收了别人的钱 ，还没人发货，欠客户的钱)
		> 其他
			- 应付工资：欠员工的工资（下一个月支付上一个月的工资）。
			- 应交税金：欠税务局的钱。

	
	# 非流动负载
		* 长期借款(一年后要偿还)
		* 应付债券
			- 在中国大部分公司这个都是：0，因为只有那些发型企业债券的公司，才有这个。

		* 长期应付款
			* 类似于，分期购买一个资产。

	# 关于租赁
		* 经营性租赁
			* 不是我的，确实是租来用的，付的就是租金。

		* 融资性租赁
			* 时间长，金额大（时间多长，金额多大，需要更具体的规定）
			* 更像是分期购买一个资产，它是一个长期应付款，是一个负债

------------------------------------
股东权益 - 钱是从哪儿来的
------------------------------------
	# 股本(外面拿进来的)
		* 具体名字跟企业的性质有关系
			- 股份有限公司：股本
			- 有限责任公司：实收资本
		
		* 在中国，股本就是注册资本（金），它表现了公司对外承担法律责任的上限
		* 其他国家，可能没有要求注册资本，那这个就是投入的最原始的资金

		* 股本结构体现了股东权益之间的分配，这个分配，不是按照出资金额，而是按照在股本中占的比例来分配。
		

	# 资本公积(外面拿进来的)
		* 股东投入的钱，大于了股本，就会记录在资本公积里面

		* 上市公司：发行了1亿股票，每股面值1块钱，就是1亿股本。但是售卖的时候，按照每股卖2元，一共2亿，多出来的1亿，就是资本公积。
		* 非上市公司：期初自己投资资金1W，后来有人想投资5W，这个人把1W放在股本，跟我占股比例各为：50%，把4W放资本公积，资本公积的钱，我也是会占50%。
			- 他用2W，换取了未来这个公司收益的50%

	# 盈余公积(盈利留下的)
		* 法律不让我们分配的利润
		* 中国法律规定，企业利润必须留一部分作为“盈余公积”，不得分配，可以多留，但是不能少留
		* 好像是 10%，其他国家好像没

	# 未分配利润(盈利留下的)
		* 自己不想分配的利润
		* 除了盈余公积，股东们分配完毕后，剩余的钱，就是未分配利润。



