------------------------
数据卷					|
------------------------
	# 数据卷
		* 数据卷就是文件或者目录, 存在于一个或者多个容器之中, 由于docker挂载到容器, 但不属于联合文件系统
		* 因此可以绕过Union File System提供一些用于持续村粗或共享数据的特性
		* 数据卷的设计目的就是为了持久化, 独立于容器的生命周期, 不会因为容器的删除而被删除

		* 特点
			1, 数据卷可以在容器之间共享
			2, 卷中的更改可以直接生效
			3, 数据卷中的更改不会包含在镜像的更新中
			4, 数据卷的生命周期, 一直持续到没有任何容器使用它为止

	# 创建数据卷
		docker volume create [name]
			name
				* 数据卷的名称
	
	# 查看所有的数据卷
		docker volume ls
		
		————————————————————————————————————————————————————————————————————————————————————
		DRIVER              VOLUME NAME
		local               3bb416400f99e7f7a6149c7b07e42ffcf12333d20a35d4c4c9a90a7a78f03278
		local               3cd87fa709e34934c2f9c349aa25c1618f3dcc5997ef61ae1214c40b891aa419
		local               5260bb4c37a27c5997146dd6455c986e0f3a4ad7f87d60d7471decf1f5236f01
		local               a97a58710879fe9c8af75796d42e8092594a31d78b5168a66eedd18e0b1aa45e
		local               e2862f5087ae9394a83db36aeb7e786e2c0982da67a22bfc09ce87aa3bd38329
		————————————————————————————————————————————————————————————————————————————————————
			
	# 查看指定数据卷的详情
		docker volume inspect [name]
			name
				* 数据卷的名称
	

	
	# 删除数据卷
		volume rm [name]
			name
				* 数据卷的名称
	
	# 清理无主的数据卷
		docker volume prune

			
