
----------------------------
BeautifulSoup				|
----------------------------
	* 大部分时候,可以把它当作 Tag 对象,它支持 遍历文档树 和 搜索文档树 中描述的大部分的方法

----------------------------
BeautifulSoup-构造函数		|
----------------------------
	BeautifulSoup()
		* 关键字参数
			parse_only
				* 该属性值应该是:SoupStrainer类实例,表示解析仅仅解析部分文档
			

----------------------------
BeautifulSoup-属性			|
----------------------------
	name 
		* 该属性值是固定的:"[document]"

----------------------------
BeautifulSoup-方法			|
----------------------------
	new_tag( name, namespace=None, nsprefix=None, **attrs)
		* 创建新的标签对象
		* name属性必须,指定标签的名称
	
	new_string()
		* 创建一个文本节点
	

	

	
