------------------------------------
IPv6
------------------------------------
	# 新版本的IP
		* 2011年2月，IPv4的地址已经耗尽，ISP已经不能再申请到新的IP地址块了。
		* 为此，解决IP地址耗尽的根本措施就是采用具有更大地址空间的新版本的IP，即IPv6。
	
	# 特点
		* 更大的地址空间。IPv6把地址从IPv4的32位增大到4倍，即增大到128位，使地址空间增大了296倍。这样大的地址空间在可预见的将来是不会用完的。
		* IPv6的 首部长度是固定的。

	# Header

		+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
		|Version| Traffic Class |           Flow Label                  |
		+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
		|         Payload Length        |  Next Header  |   Hop Limit   |
		+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
		|                                                               |
		+                                                               +
		|                                                               |
		+                         Source Address                        +
		|                                                               |
		+                                                               +
		|                                                               |
		+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
		|                                                               |
		+                                                               +
		|                                                               |
		+                      Destination Address                      +
		|                                                               |
		+                                                               +
		|                                                               |
		+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
		


	

		Version 版本号，4 位
			* 指明了协议的版本，对IPv6该字段是6。
		
		Traffic Class 通信量类，8位
			* 这是为了区分不同的IPv6数据报的类别或优先级。目前正在进行不同的通信量类性能的实验。
		
		Flow Label 流标号，20 位
			* Pv6提出流(flow)的抽象概念
			* 所谓“流”就是互联网络上从特定源点到特定终点（单播或多播）的一系列数据报（如实时音频或视频传输）​，而在这个“流”所经过的路径上的路由器都保证指明的服务质量。
		
		Payload Lengt 有效载荷长度，16 位
			* 指明IPv6数据报除基本首部以外的字节数（所有扩展首部都算在有效载荷之内）​。
			* 这个字段的最大值是 64 KB（65535 字节）​。

		Next Header 下一个Header，8位
			* 它相当于IPv4的协议字段或可选字段。
			* 当IPv6数据报没有扩展首部时，下一个首部字段的作用和IPv4的协议字段一样
			* 它的值指出了基本首部后面的数据应交付IP层上面的哪一个高层协议（例如：6或17分别表示应交付运输层的TCP或UDP）​。

		Hop Limit 跳数限制，8 位
			* 用来防止数据报在网络中无限期地存在。源点在每个数据报发出时即设定某个跳数限制（最大为255跳）​。
			* 每个路由器在转发数据报时，要先把跳数限制字段中的值减1。当跳数限制的值为零时，就要把这个数据报丢弃。
		
		Source Address 源地址，128 位
		Destination Address 目标地址，128 位
			

	# IPv6的扩展首部
		