----------------------------
Python-浅拷贝				|
----------------------------
	# 列表
		arr1 = ['1','2','3']
		arr2 = arr1.copy()

		arr2[0] = '一'

		print(arr1)
		print(arr2)
		# ['1', '2', '3']
		# ['一', '2', '3']


		arr1 = [[1,2],'2','3']
		arr2 = arr1.copy()
		arr2[0][0] = '一'
		print(arr1)
		print(arr2)
		# [['一', 2], '2', '3']
		# [['一', 2], '2', '3']
	
	# 总结
		* 潜拷贝,其实就是把列表中的所有元素的内存地址,都复制一份,放到了新的列表中
		* 列表使用切片,也可以完成浅拷贝的效果
			arr = [1,2,3]	
			arr.copy()
			arr[:]
	
	# 使用第三方模块完成浅拷贝
		import copy
		arr1 = [['1'],'2','3']
		arr3 = copy.copy(arr1)
			* 深拷贝
		
----------------------------
Python-深拷贝				|
----------------------------
	# 深copy,是把值,进行复制,而不是地址值.
	# 需要使用到模块
		import copy
		arr1 = [['1'],'2','3']

		arr2 = copy.copy(arr1)
			* 浅拷贝

		arr3 = copy.deepcopy(arr1)
			* 深拷贝

	# demo
		import copy

		arr1 = [['1'],'2','3']

		arr2 = copy.copy(arr1)

		arr2[0][0] = '15'           # 浅拷贝,直接修改会影响母体

		arr3 = copy.deepcopy(arr1)

		arr3[0][0] = '18'           # 深拷贝,修改本体,不会影响母体

		print(arr1) # [['15'], '2', '3']
		print(arr2) # [['15'], '2', '3']
		print(arr3) # [['18'], '2', '3']