----------------------
存储器
----------------------
	# 存储器类型
		* 存储介质
			1. 半导体存储器，TTL、MOS（易失）
			2. 磁表面存储器，磁头、磁载体
			3. 磁芯存储器，硬磁材料，环状元件
			4. 光盘存储器
		* 存取方式
			1. 存取时间和物理地址无关（随机访问）
				1. 随机存储器，执行过程中可读、可写
				2. 只读存储器
			
			2. 存取时间与物理地址有关（串行访问）
				1. 顺序存取存储器，磁带
				2. 直接存取存储器，磁盘
			
		* 作用
			1. 主存储器
				1. RAM，随机访问存储器
					1. 静态 RAM
				 	2. 动态 RAM
				2. ROM，只读存储器
					1. MROM
					2. PROM
					3. EPROM
					4. EEPROM
			
			2. Flash Memory
			3. 高速缓冲存储器（Cache）
			4. 辅助存储器


	# 存储器层次结构
		* 寄存器
		* 缓存
		* 主存
		* 磁盘
		* 光盘
		* 磁带

		* 缓存 - 主存 - 辅存

----------------------
主存储器
----------------------
	# 概述
		* 主存的基本组成
		* 主存中，存储单元的地址分配
		* 主存与 CPU 之间的关系
		* 主存中存储单元地址的分配
		* 主存的技术指标
	
	# 半导体存储芯片
		* 基本结构
		* 译码驱动方式
			* 线选法
			* 重合法
	
	# 随机存储存储器
		* 静态 RAM
		* 动态 RAM

