-----------------------
navigator				|
-----------------------
	# 可以获取浏览器的一些信息

-----------------------
navigator	属性		|
-----------------------
	appName;			
		* 返回浏览器的名称

	appCodeName
		* 浏览器代号

	appVersion 
		* 浏览器版本
	
	platform 
		* 硬件平台

	userAgent 
		* 浏览器HTTP发送的头,通常包含了 appVersion 中的所有信息
		* 因为这个头包含了大部分信息,所以'浏览器嗅探'一般会用它

	systemLanguage 
		* 系统语言环境

	onLine 
		* 如果该属性存在,则表示当前浏览器联网
	
	cookieEnabled
		* 检测是否启用Cookie

-----------------------
navigator	方法		|
-----------------------


-----------------------
navigator	事件		|
-----------------------