-----------------------
MySQL-操作数据			|
-----------------------
	# 插入数据
		insert into [表名] ([字段1,字段2...字段n]) values([值1],[值2],...[值n]);
			* 给指定字段插入数据
			* 要保证字段和值的对应
		insert into [表名] values([值1],[值2],...[值n]);
			* 给所有字段都插入数据
			* 同样要保证数据的对应

		* 只要是'非数值'数据,都要加上单引号(建议是单引号).
		* 一次性插入多条记录
			insert into [表名] values([字段1]..),([字段1]..);
				insert into demo values('1','2'),('2','3');
				insert into demo(id,name) values('1','2'),('2','3');

	# 查看数据(入门级别)
		select [字段1],[字段2],...[字段n] from [表名] where [条件];
			* 查询指定的字段的数据
		select * from [表名] where [条件];
			* 查询所有字段的数据
	
	# 删除一条数据
		delete from [表名] where [条件];
			* 不设置条件,就全部删除了...

	# 更新一条数据
		update [表名] set [字段1] = [值1],[字段2] = [值2],...[字段n] = [值n] where [条件];
			* 不设置条件,就是更新全部了
	