--------------------
mysql8
--------------------
	# 新特性
		新！ Document Store用于使用单个数据库开发SQL和NoSQL文档应用程序。
		新！ 事务数据字典实现为存储在单个InnoDB表空间中的一组SQL表。
		新！ SQL授予和拒绝用户组权限的角色，大大减少了安全工作量。
		新！ 默认为utf8mb4字符集，用于更丰富的移动应用程序和国际字符集。
		新！ 公用表表达式也被称为WITH查询已被添加到MySQL 8.0中。
		新！ 窗口函数以减少代码复杂性并帮助开发人员提高生产力。
		新！ 隐形索引可以更好地管理24x7全天候运行的应用程序的软件升级和数据库更改。
		新！ 降序索引可以消除排序结果的需求并提高性能。

		改进！ JSON支持包含JSON_TABLE（）函数，它接受JSON数据并将其作为关系表返回。
		改进！ 速度提高了2倍，并设置了高达180万次查询/秒的新基准测试记录。
		改进！ OpenSSL  作为MySQL中的默认TLS / SSL库。改进！ 性能模式，查询速度高达30倍。
		改进！ 信息模式，查询速度高达100倍。
		改进！ GIS得到增强以支持地理和空间参考系统（SRS）。
		改进！ Replication和InnoDB集群可以更好地扩展大量应用程序。

		可靠性  需要很少或根本不需要干预来实现持续正常运行轻松使用  “从下载到开发3分钟”的安装和配置。
		低管理  ，只需很少的数据库维护。复制  提供灵活的拓扑以实现横向扩展和高可用性。
		分区  以提高超大型数据库环境的性能和管理。ACID Transactions  构建可靠和安全的业务关键型应用程序。
		存储过程  来提高开发人员的生产力。
		触发器  在数据库级执行复杂的业务规则。 
		确保敏感信息不受影响的观点。
	
	# 下载
		https://dev.mysql.com/downloads/mysql/
		https://dev.mysql.com/downloads/repo/yum/

	
