------------------------
数据库基础				|
------------------------
	# 数据库(DataBases),存储数据的仓库
		1,xml
		2,文本也算
		# 存储介质:硬盘
	# 关系型数据库(SQL)
		1,MySQL			//轻量级
		2,Oracle		//重量级
		3,SQL Server	//轻量级
		4,db2			//重量级
		# 存储介质:硬盘
	# 非关系型数据库(NOSQL)
		1,Redis
		# 存储介质:内存/硬盘
	# 面向对象的数据库
		# 还不成熟
	
------------------------
数据库关键字			|
------------------------
	# 数据库:databases
	# 数据库系统:DBS(Databases System)
	# 数据库管理员:DBA
------------------------
SQL						|
------------------------
	# 结构化查询语言
	# 分为三个部分
		DDL:数据定义语言(维护存储数据的结构),操作数据库,表
			create,drop,alter
		DML:数据操作语言
			insert,update,delete
			DQL:查询语言
			SELECT
		DCL:数据控制语言,权限,之类的控制
			grant,revoke
	# SQL是关系型数据库的操作指令,是一种约束,非强制
	  不同的SQL厂商之间,SQL会有一些细微的差别