----------------------------
Scale						|
----------------------------
	* 滑块组件,就是通过修改滑块,来达到修改值的目的
	* 构造函数
		 def __init__(self, master=None, cnf={}, **kw):

----------------------------
Scale-属性					|
----------------------------
	from_
		* 最小值(默认0)
		* from 是python关键字,所以后面要添加一个下划线
	to
		* 最大值(默认100)
	orient
		* 滚动条的方向(默认是垂直的)
			HORIZONTAL	水平滚动条
	tickinterval
		* 显示刻度条,设置刻度条的显示步长
	resolution
		* 滑块滑动步长,每次滑动,移动多少个单位
		* 该值应该与 tickinterval 一样
	length
		* 组件的宽带,单位是像素

----------------------------
Scale-方法					|
----------------------------
	get()
		* 返回当前滑块的值
	

